In [2]:
import pandas as pd

In [4]:
data = pd.read_csv(r"C:\Users\anas.s\Desktop\Ex_Files_ETL_Python_SQL\Exercise Files\Chapter_1\sample_data.csv")

In [5]:
data.head()

,Name,Email,Phone,Address,City,Country,Date of Birth,Salary
0,Lisa West,andrew23@example.com,(465)852-8470,Unit 5183 Box 8914\nDPO AP 26775,Perezfort,Honduras,2001-08-05,83302.0
1,Jason Cole,kenneth05@example.net,7783540568,73784 Kenneth Stream Apt. 200\nFitzgeraldshire...,Port Andrea,Bolivia,2012-12-04,31035.0
2,Juan Crosby,zbarnes@example.org,(676)328-6244x05295,"0580 Mary Row\nLake Vanessabury, GA 81529",Johnborough,South Africa,1921-02-02,60226.0
3,April Ball,michaelmckinney@example.com,+1-633-685-4901x2113,"6215 Hensley Pass Apt. 136\nSouth Patricia, MN...",New Eric,Greece,2023-05-08,52502.0
4,Donald Jackson,peterdean@example.com,779-437-7643,"156 Macdonald Alley\nWest Scottmouth, MA 82872",Alyssaborough,Namibia,2019-03-07,38687.0

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           200 non-null    object
 1   Email          200 non-null    object
 2   Phone          200 non-null    object
 3   Address        200 non-null    object
 4   City           198 non-null    object
 5   Country        197 non-null    object
 6   Date of Birth  193 non-null    object
 7   Salary         193 non-null    float64
dtypes: float64(1), object(7)
memory usage: 12.6+ KB

In [7]:
data.shape

(200, 8)

In [12]:
data.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
195     True
196     True
197     True
198     True
199     True
Length: 200, dtype: bool

In [13]:
data.drop_duplicates()

,Name,Email,Phone,Address,City,Country,Date of Birth,Salary
0,Lisa West,andrew23@example.com,(465)852-8470,Unit 5183 Box 8914\nDPO AP 26775,Perezfort,Honduras,2001-08-05,83302.0
1,Jason Cole,kenneth05@example.net,7783540568,73784 Kenneth Stream Apt. 200\nFitzgeraldshire...,Port Andrea,Bolivia,2012-12-04,31035.0
2,Juan Crosby,zbarnes@example.org,(676)328-6244x05295,"0580 Mary Row\nLake Vanessabury, GA 81529",Johnborough,South Africa,1921-02-02,60226.0
3,April Ball,michaelmckinney@example.com,+1-633-685-4901x2113,"6215 Hensley Pass Apt. 136\nSouth Patricia, MN...",New Eric,Greece,2023-05-08,52502.0
4,Donald Jackson,peterdean@example.com,779-437-7643,"156 Macdonald Alley\nWest Scottmouth, MA 82872",Alyssaborough,Namibia,2019-03-07,38687.0
...,...,...,...,...,...,...,...,...
185,Derek Gonzales,morrisdennis@example.org,001-925-305-9769,"5721 Stewart Station\nPort Natalie, MH 92558",Thompsonburgh,Korea,2005-08-07,97074.0
186,Kimberly Hardy,austinthompson@example.com,(903)716-6739x99186,"9188 Johnson Coves\nNew Ericview, NC 11708",Lake Garyport,United States of America,1951-08-04,90426.0
187,Ashley Zimmerman,mary96@example.net,280-529-0456x02617,"021 Baker Stream Apt. 288\nFoleyville, TN 71682",Fitzgeraldbury,Cayman Islands,1932-10-12,81496.0
188,Marc Myers,christopher87@example.org,671.515.9764x99092,USCGC Colon\nFPO AA 43946,Kellyville,Greece,2014-02-19,69587.0
189,Jessica Rodriguez,finleystephanie@example.com,(312)467-6244x90532,"PSC 3541, Box 4224\nAPO AE 82736",Deniseborough,Bahamas,1972-06-10,52866.0

In [14]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           200 non-null    object
 1   Email          200 non-null    object
 2   Phone          200 non-null    object
 3   Address        200 non-null    object
 4   City           198 non-null    object
 5   Country        197 non-null    object
 6   Date of Birth  193 non-null    object
 7   Salary         193 non-null    float64
dtypes: float64(1), object(7)
memory usage: 12.6+ KB

In [17]:
data.shape

(200, 8)